&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		КартаМаршрута=БизнесПроцессы.ОповещениеСпасателей.ПолучитьКартуМаршрута();
	Иначе
		КартаМаршрута=Объект.Ссылка.ПолучитьОбъект().ПолучитьКартуМаршрута();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКарту(Команда)
	ОбновитьКартуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуНаСервере()
	Если Объект.Ссылка.Пустая() Тогда
		КартаМаршрута=БизнесПроцессы.ОповещениеСпасателей.ПолучитьКартуМаршрута();
	Иначе
		КартаМаршрута=Объект.Ссылка.ПолучитьОбъект().ПолучитьКартуМаршрута();
	КонецЕсли;
КонецПроцедуры
