Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ОстаткиРесурсов.Записывать = Истина;
	Для Каждого ТекСтрокаСписокРесурсов из СписокРесурсов Цикл
		Движение = Движения.ОстаткиРесурсов.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Ресурс = ТекСтрокаСписокРесурсов.Ресурс;
		Движение.Количество = ТекСтрокаСписокРесурсов.Количество;
	КонецЦикла;
	Движения.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиРесурсовОстатки.Ресурс,
		|	ОстаткиРесурсовОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиРесурсов.Остатки КАК ОстаткиРесурсовОстатки
		|ГДЕ
		|	ОстаткиРесурсовОстатки.КоличествоОстаток < 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("мало ресурса " + ВыборкаДетальныеЗаписи.Ресурс + ",не хватает ещё "
			 		 + ( -ВыборкаДетальныеЗаписи.КоличествоОстаток))
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры