

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		КартаМаршрута=БизнесПроцессы.ОповещениеСпасателей.ПолучитьКартуМаршрута();
	Иначе
		КартаМаршрута=Объект.Ссылка.ПолучитьОбъект().ПолучитьКартуМаршрута();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачатьСбор(Команда)
	НачатьСборНаСервере();
КонецПроцедуры

&НаСервере
Процедура НачатьСборНаСервере()

	Запрос=Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс.Ссылка = &ВыбранныйПроцесс
		|	И ЗадачаИсполнителя.ТочкаМаршрута = &ТочкаМаршрута";
	Запрос.УстановитьПараметр("ВыбранныйПроцесс", ЭтотОбъект.Объект.Ссылка );
	Запрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.ОповещениеСпасателей.ТочкиМаршрута.Действие );
	Результат = Запрос.Выполнить();

	Выборка = Результат.Выгрузить();
	Для каждого СтрокаЗапроса из Выборка Цикл
		Задача = СтрокаЗапроса.Ссылка.ПолучитьОбъект();
		Задача.ВыполнитьЗадачу();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКарту(Команда)
	ОбновитьКартуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуНаСервере()
	Если Объект.Ссылка.Пустая() Тогда
		КартаМаршрута=БизнесПроцессы.ОповещениеСпасателей.ПолучитьКартуМаршрута();
	Иначе
		КартаМаршрута=Объект.Ссылка.ПолучитьОбъект().ПолучитьКартуМаршрута();
	КонецЕсли;
КонецПроцедуры


