Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиРесурсов
	Движения.ОстаткиРесурсов.Записывать = Истина;
	Для Каждого ТекСтрокаСписокРесурсов из СписокРесурсов Цикл
		Движение = Движения.ОстаткиРесурсов.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Ресурс = ТекСтрокаСписокРесурсов.Ресурс;
		Движение.Количество = ТекСтрокаСписокРесурсов.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры