Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)

    ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();

    Пользователь = Справочники.Пользователи.НайтиПоКоду(ПользовательИБ.Имя);
    Если Пользователь = Справочники.Пользователи.ПустаяСсылка() Тогда

        Пользователь = Справочники.Пользователи.СоздатьЭлемент();
        Пользователь.Код = ПользовательИБ.Имя;
        Пользователь.Наименование = ПользовательИБ.Имя;
        Пользователь.Записать();
    КонецЕсли;


    ПараметрыСеанса.ТекущийПользователь = Пользователь.Ссылка;

КонецПроцедуры