

Процедура УсловиеПроверкаУсловия(ТочкаМаршрута, Результат)
	Результат=Ложь;
	Если Ликвидирован Тогда
		Результат=Истина;
	КонецЕсли;
КонецПроцедуры

Процедура СозданиеСобытияПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
		Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Задание="Создать и заполнить документ событие";
	КонецЦикла;
КонецПроцедуры

Процедура СозданиеОСПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Задание="Создать и заполнить оперативную сводку";
	КонецЦикла;
КонецПроцедуры

Процедура СозданиеПланаПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Задание="разработать план реагирования на ЧС";
	КонецЦикла;
КонецПроцедуры

Процедура ОповещениеСпасателейМЧСПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Задание="начать сбор спасателей МЧС";
	КонецЦикла;
КонецПроцедуры

Процедура СозданиеБригадыПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Задание="сформировать бригаду";
	КонецЦикла;
КонецПроцедуры

Процедура НаписаниеДокладаПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Задание="доложить о результатах выполнения плана";
	КонецЦикла;
КонецПроцедуры






