


Процедура Действие1ПередСозданиемЗадач(ТочкаМаршрута, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Для Каждого Спасатель из ГотовыеСпасатели Цикл

		Если (Спасатель.Подтвердил) Тогда
			НоваяЗадача=Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
			НоваяЗадача.Задание="Явиться в точку сбора" + ТочкаСбора;
			НоваяЗадача.Наименование="Сбор";
			НоваяЗадача.Дата=Дата;
			НоваяЗадача.Исполнитель=Спасатель.Имя;
			НоваяЗадача.БизнесПроцесс=Ссылка;
			НоваяЗадача.ТочкаМаршрута=БизнесПроцессы.ОповещениеСпасателей.ТочкиМаршрута.Действие1;
			ФормируемыеЗадачи.Добавить(НоваяЗадача);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Процедура ДействиеПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Наименование="Оповещение";
		Задача.Задание="Подтвердить возможность участия";
		Сообщить(Задача.ТочкаМаршрута);
	КонецЦикла;
КонецПроцедуры



Процедура СтартПередСтартом(ТочкаМаршрута, Отказ)
	Выборка=РегистрыСведений.РегистрАдресации.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если (Выборка.РольИсполнителя=Справочники.РолиПользователей.СпасательМЧС) Тогда
			Объект=ГотовыеСпасатели.Добавить();
			Объект.Имя=Выборка.Исполнитель;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры





